Repository: CofficLab/Lumi
Catalog: LumiApp/Plugins/DevAssistantPlugin/DevAssistant.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: %@ (%ld lines)...
zh_hans: %@ (%ld 行)...
zh_hk: %@ (%ld 行)...

source: Access knowledge and code from GitHub repositories.
zh_hans: 访问 GitHub 仓库中的知识和代码。
zh_hk: 訪問 GitHub 倉庫中的知識和代碼。

source: Agentic coding assistant
zh_hans: 智能编程助手
zh_hk: 智慧程式設計助手

source: Allow
zh_hans: 允许
zh_hk: 允許

source: API Key 将安全存储在系统钥匙串中
zh_hk: API Key 將安全儲存在系統鑰匙圈中

source: API 密钥
zh_hk: API 金鑰

source: COMMAND
zh_hans: 命令
zh_hk: 指令

source: Configuration Required
zh_hans: 需要配置
zh_hk: 需要配置

source: Connected
zh_hans: 已连接
zh_hk: 已連線

source: Deny
zh_hans: 拒绝
zh_hk: 拒絕

source: Details
zh_hans: 详情
zh_hk: 詳情

source: Dev Assistant
zh_hans: 开发助手
zh_hk: 開發助手

source: Disconnected
zh_hans: 已断开
zh_hk: 已斷線

source: Empower your agent with visual capabilities using Zhipu GLM-4V. Supports image analysis, UI-to-code, and more.
zh_hans: 使用智谱 GLM-4V 为您的助手赋能视觉能力。支持图像分析、UI 转代码等功能。
zh_hk: 使用智譜 GLM-4V 為您的助手賦能視覺能力。支援圖像分析、UI 轉程式碼等功能。

source: Enter value
zh_hans: 输入值
zh_hk: 輸入值

source: ENVIRONMENT VARIABLES
zh_hans: 环境变量
zh_hk: 環境變數

source: Execute %@
zh_hans: 执行 %@
zh_hk: 執行 %@

source: Execute command: %@
zh_hans: 执行命令: %@
zh_hk: 執行指令: %@

source: Extract content and structured data from any webpage.
zh_hans: 从任何网页提取内容和结构化数据。
zh_hk: 從任何網頁提取內容和結構化數據。

source: Go to Marketplace to install servers
zh_hans: 前往市场安装服务器
zh_hk: 前往市場安裝伺服器

source: HOMEPAGE
zh_hans: 主页
zh_hk: 首頁

source: Install
zh_hans: 安装
zh_hk: 安裝

source: Install %@
zh_hans: 安装 %@
zh_hk: 安裝 %@

source: Install Server
zh_hans: 安装服务器
zh_hk: 安裝伺服器

source: Installed
zh_hans: 已安装
zh_hk: 已安裝

source: LLM 供应商
zh_hk: LLM 供應商

source: Marketplace
zh_hans: 市场
zh_hk: 市場

source: MCP Servers
zh_hans: MCP 服务器
zh_hk: MCP 伺服器

source: No configuration required.
zh_hans: 无需配置。
zh_hk: 無需配置。

source: No MCP servers configured
zh_hans: 未配置 MCP 服务器
zh_hk: 未配置 MCP 伺服器

source: Permission Request
zh_hans: 权限请求
zh_hk: 權限請求

source: Reader MCP
zh_hans: 阅读器 MCP
zh_hk: 閱讀器 MCP

source: Real-time web search capabilities for your agent.
zh_hans: 为您的智能体提供实时网络搜索能力。
zh_hk: 為您的智能體提供實時網絡搜尋能力。

source: Reinstall
zh_hans: 重新安装
zh_hk: 重新安裝

source: Search MCP
zh_hans: 搜索 MCP
zh_hk: 搜尋 MCP

source: The assistant is trying to perform a %@ action.
zh_hans: 助手正在尝试执行 %@ 操作。
zh_hk: 助手正在嘗試執行 %@ 操作。

source: Tool Output
zh_hans: 工具输出
zh_hk: 工具輸出

source: Tools available when connected.
zh_hans: 连接后可用工具。
zh_hk: 連線後可用工具。

source: Vision MCP
zh_hans: 视觉 MCP
zh_hk: 視覺 MCP

source: Visit Homepage
zh_hans: 访问主页
zh_hk: 訪問首頁

source: Write file: %@
zh_hans: 写入文件: %@
zh_hk: 寫入檔案: %@

source: 开发助手
zh_hk: 開發助手

source: 未知供应商
zh_hk: 未知供應商

source: 设置
zh_hk: 設定

source: 输入 API Key
zh_hk: 輸入 API Key

source: 默认
zh_hk: 預設
